paper/generic properties of groups.org
#+title: Generic Properties Of Groups

#+AUTHOR: Marcin Petrykowski
#+EXPORT_FILE_NAME: ../latex/papers/generic properties of groups.tex
#+LATEX_HEADER: \graphicspath{{../../books/}}
#+LATEX_HEADER: \input{../preamble.tex}
#+LATEX_HEADER: \makeindex

* Preliminaries
    If \(p(\barx)\) is a type over \(A\), then we call the set of realizations of \(p\) in \(M\)
    \begin{equation*}
    p(M^n)=\{\bara\in M^n:(\forall\varphi(\barx)\in p(\barx))M\vDash\varphi(\bara)\}\vDash\bigcap_{\varphi(\barx)\in p(\barx)}\varphi(M^n)
    \end{equation*}
    *type definable over* \(A\). If \(V\) is a 0-type-definable subset of \(M^n\), then we sometimes
     identify \(V\) with the set
     \begin{equation*}
    [V]=\{\tp(\bara):\bara\in V\}\subseteq S_n(\emptyset)
     \end{equation*}

     A first order structure \(M\) is \kappa-saturated if for any \(A\subseteq M\) with \(\abs{A}<\kappa\), \(n<\omega\)
     and \(p\in S_n(A)\), \(p\) has a realization in \(M\).

     A group \((G,\cdot)\) is definable in a structure \(M\) is \(G\) is a definable subset of \(M^n\)
     for some \(n<\omega\) and the group action \(\cdot:G\times G\to G\) is a definable function in \(M\).
     If \(p(x)\) is a type over \(G\) and \(g\in G\), then
     \begin{equation*}
    g\cdot p(x)=\{g\cdot\varphi(x):\varphi(x)\in p(x)\}=\{\varphi(g^{-1}\cdot x):\varphi(x)\in p(x)\}
     \end{equation*}
     A group \((G,\cdot)\) is definable in a structure \(M\) if \(G\) is a definable

     An infinite totally ordered first order structure \((M,<,\dots)\) is *o-minimal* if every definable
     subset of \(M\) is a union of finitely many intervals and points.

     Let \((M,<,\dots)\) be an o-minimal structure. We usually say "ultimately" instead of "for all
     sufficiently large \(a\in M\)". We denote an open interval with endpoints \(a\) and \(b\)
     by \((a,b)\) and a closed one by \([a,b]\). In contrast, \(\la a,b\ra\) denotes the pair of
     elements \(a\) and \(b\).

     If \(a\in M\cup\{-\infty\}\), \(b\in M\cup\{+\infty\}\), \(a<b\) and \(f:(a,b)\to M\) is a definable function, then there
     are \(a=a_1<\dots<a_n=b\) s.t. each interval \((a_i,a_{i+1})\) of \(f\) is either constant or
     strictly monotone and continuous in the order topology. In particular, every definable
     function \(f:M\to M\) is ultimately continuous and monotone

* Weak generic types
** Introduction
    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    A set \(X\subseteq G\) is *(left) generic* if some finitely many left \(G\)-translates of \(X\)
    cover \(G\). We say that a formula \(\varphi(x)\) is *(left) generic* if the set \(\varphi(G)\) of elements
    of \(G\) realizing \varphi is *(left) generic*. Finally, we say that a type \(p(x)\) of elements
    of \(G\) is *(left) generic* if every formula \(\varphi(x)\) with \(p(x)\vdash\varphi(x)\) is (left) generic
    #+END_definition

    In the stable case left generic = right generic <<Problem1>>

    and each partial generic type extends to a complete generic type (since type is definable)

    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    A set \(A\subseteq G\) is *weak generic*, if for some non-generic \(B\subseteq G\) we have that \(A\cup B\) is
    generic. A formula \(\varphi(x)\) is *weak generic* if the set \(\varphi(G)\) is weak generic. A type \(p(x)\)
    of elements of \(G\) is weak generic if every formula \(\varphi(x)\) with \(p(x)\vdash\varphi(x)\) is weak generic
    #+END_definition

