latex/papers/generic properties of groups.tex
% Created 2022-09-22 Thu 18:32
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\graphicspath{{../../books/}}
\input{../preamble.tex}
\makeindex
\author{Marcin Petrykowski}
\date{\today}
\title{Generic Properties Of Groups}
\hypersetup{
 pdfauthor={Marcin Petrykowski},
 pdftitle={Generic Properties Of Groups},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.92 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Preliminaries}
\label{sec:org865ca19}
If \(p(\barx)\) is a type over \(A\), then we call the set of realizations of \(p\) in \(M\)
\begin{equation*}
p(M^n)=\{\bara\in M^n:(\forall\varphi(\barx)\in p(\barx))M\vDash\varphi(\bara)\}\vDash\bigcap_{\varphi(\barx)\in p(\barx)}\varphi(M^n)
\end{equation*}
\textbf{type definable over} \(A\). If \(V\) is a 0-type-definable subset of \(M^n\), then we sometimes
 identify \(V\) with the set
 \begin{equation*}
[V]=\{\tp(\bara):\bara\in V\}\subseteq S_n(\emptyset)
 \end{equation*}

A first order structure \(M\) is \(\kappa\)-saturated if for any \(A\subseteq M\) with \(\abs{A}<\kappa\), \(n<\omega\)
and \(p\in S_n(A)\), \(p\) has a realization in \(M\).

A group \((G,\cdot)\) is definable in a structure \(M\) is \(G\) is a definable subset of \(M^n\)
for some \(n<\omega\) and the group action \(\cdot:G\times G\to G\) is a definable function in \(M\).
If \(p(x)\) is a type over \(G\) and \(g\in G\), then
 \begin{equation*}
g\cdot p(x)=\{g\cdot\varphi(x):\varphi(x)\in p(x)\}=\{\varphi(g^{-1}\cdot x):\varphi(x)\in p(x)\}
 \end{equation*}
A group \((G,\cdot)\) is definable in a structure \(M\) if \(G\) is a definable

An infinite totally ordered first order structure \((M,<,\dots)\) is \textbf{o-minimal} if every definable
subset of \(M\) is a union of finitely many intervals and points.

Let \((M,<,\dots)\) be an o-minimal structure. We usually say ``ultimately'' instead of ``for all
sufficiently large \(a\in M\)''. We denote an open interval with endpoints \(a\) and \(b\)
by \((a,b)\) and a closed one by \([a,b]\). In contrast, \(\la a,b\ra\) denotes the pair of
elements \(a\) and \(b\).

If \(a\in M\cup\{-\infty\}\), \(b\in M\cup\{+\infty\}\), \(a<b\) and \(f:(a,b)\to M\) is a definable function, then there
are \(a=a_1<\dots<a_n=b\) s.t. each interval \((a_i,a_{i+1})\) of \(f\) is either constant or
strictly monotone and continuous in the order topology. In particular, every definable
function \(f:M\to M\) is ultimately continuous and monotone

\section{Weak generic types}
\label{sec:org9289734}
\subsection{Introduction}
\label{sec:orga17b735}
\begin{definition}
A set \(X\subseteq G\) is \textbf{(left) generic} if some finitely many left \(G\)-translates of \(X\)
cover \(G\). We say that a formula \(\varphi(x)\) is \textbf{(left) generic} if the set \(\varphi(G)\) of elements
of \(G\) realizing \(\varphi\) is \textbf{(left) generic}. Finally, we say that a type \(p(x)\) of elements
of \(G\) is \textbf{(left) generic} if every formula \(\varphi(x)\) with \(p(x)\vdash\varphi(x)\) is (left) generic
\end{definition}

In the stable case left generic = right generic \label{Problem1}

and each partial generic type extends to a complete generic type (since type is definable)

\begin{definition}[]
A set \(A\subseteq G\) is \textbf{weak generic}, if for some non-generic \(B\subseteq G\) we have that \(A\cup B\) is
generic. A formula \(\varphi(x)\) is \textbf{weak generic} if the set \(\varphi(G)\) is weak generic. A type \(p(x)\)
of elements of \(G\) is weak generic if every formula \(\varphi(x)\) with \(p(x)\vdash\varphi(x)\) is weak generic
\end{definition}
