paper/generic properties of groups.org
** Basic properties of weak generic sets and types
    #+ATTR_LATEX: :options []
    #+BEGIN_lemma
    label:3.2.1
    Assume that \(G\) is a group and \(X\) is a definable subset of \(G\). TFAE
    1. the set \(X\) is weak generic
    2. for some finitely many elements \(a_1,\dots,a_n\in G\) the set \(G\setminus\bigcup_{i=1}^na_i\cdot X\) is not generic
    3. for some definable non-generic set \(Y\subseteq G\) the set \(X\cup Y\) is generic
    #+END_lemma

    #+BEGIN_proof
    \(1\Rightarrow 2\): Assume \(X\) is weak generic, then there is non-generic set \(Y\subseteq G\) s.t. \(X\cup Y\) is
    generic. Then there are \(a_1,\dots,a_n\in G\) s.t.
    \begin{equation*}
    \bigcup_{i=1}^na_i\cdot(X\cup Y)=\bigcup_{i=1}^na_i\cdot X\cup\bigcup_{i=1}^na_i\cdot Y=G
    \end{equation*}
    This means that
    \begin{equation*}
    G\setminus\bigcup_{i=1}^na_i\cdot X\subseteq\bigcup_{i=1}^na_i\cdot Y
    \end{equation*}

    \(2\Rightarrow 3\): Let \(Y=G\setminus\bigcup_{i=1}^na_i\cdot X\). Then \(Y\) is definable and not generic so
    putting \(a_{n+1}=e\). Then \(G=\bigcup_{i=1}^{n+1}a_i\cdot(X\cup Y)\)
    #+END_proof

    #+ATTR_LATEX: :options []
    #+BEGIN_lemma
    label:3.2.2
    1. If \(X,Y\subseteq G\) are not weak generic, then \(X\cup Y\) is not weak generic
    2. If \(p(x)\) is a (partial) weak generic type over \(A\subseteq G\), then \(p(x)\) may be extended to
       a complete weak generic type over \(A\)
    #+END_lemma

    #+BEGIN_proof
    1. Let \(Z\subseteq G\)  be non-generic. \(Y\) is not weak generic so \(Y\cup Z\) is not generic,
       so \(Y\cup Z\cup X\) is not generic
    2. non weak generics form an ideal

       Let \(q(x)=\{\varphi(x)\in L(A):p(x)\cup\{\neg\varphi(x)\}\text{ is not weak generic}\}\). Then \(p\subseteq q\). We shall
       show that \(q\) is a consistent partial type over \(A\). If not, then
       \begin{equation*}
       G\vDash\neg\exists x\bigwedge_{k=1}^n\varphi_k(x)
       \end{equation*}
       for some \(n<\omega\) and \(\varphi_1,\dots,\varphi_n\in q\). By compactness, for each \(k\in\{1,\dots,n\}\) we can find a
       finite set of formulas \(p_k\subseteq p\) s.t. the type \(p_k(x)\cup\{\neg\varphi_k(x)\}\) is not weak generic.
       Let \(\psi(x)=\bigwedge\{p_k(x):1\le k\le n\}\) and note that for every \(k\in\{1,\dots,n\}\) the set \(\psi(G)\cap\neg\varphi_k(G)\)
       is not weak generic. By 1, neither is the union
       \begin{equation*}
       \bigcup_{k=1}^n(\psi(G)\cap\neg\varphi_k(G))=\psi(G)\cap\bigcup_{k=1}^n\neg\varphi_k(G)=\psi(G)\cap G=\psi(G)
       \end{equation*}
       contradicting the fact that \(p(x)\vdash\psi(x)\). Finally we take any \(r(x)\in S(A)\)
       with \(r\supseteq q\) and the proof is complete
    #+END_proof

    We see that (complete) weak generic types exist. By Lemma ref:3.2.2, the set
    \begin{equation*}
    WGEN(A)=\{p\in S(A):p\text{ is weak generic}\}
    \end{equation*}
    is closed and non-empty in \(S(A)\)

    #+ATTR_LATEX: :options []
    #+BEGIN_lemma
    label:3.2.3
    Assume \(G\) is a group and \(A\subseteq G\)
    1. If some weak generic type \(p(x)\in S(G)\) is generic, then all weak generic
       types \(q(x)\in S(A)\) are generic
    2. If for every \(p,q\in WGEN(G)\) there is \(g\in G\) s.t. \(g\cdot p=q\), then all weak generic
       types \(q(x)\in S(A)\) are generic
    3. If there is just one weak generic type in \(S(A)\), then it is generic
    #+END_lemma

    #+BEGIN_proof
    1. Suppose that some weak generic type \(q(x)\in S(A)\) is not generic. Then some definable
       generic set \(X\subseteq G\) may be divided into two non-generic definable sets \(X_1,X_2\).
       Since \(X\) is generic, some left \(G\)-translates \(X'\) of \(X\) belongs to \(p(x)\). Then
       the corresponding translates \(X_1',X_2'\) of \(X_1,X_2\) are also non-generic and one of them
       belongs to \(p(x)\). Hence \(p(x)\) is not generic, a contradiction
    2. If not, then we can find a formula \(\varphi(x)\in L(A)\) which is weak generic but not generic. Note
       that \(\{\neg g\cdot\varphi(x):g\in G\}\) is a partial weak generic type over \(G\): for each \(m<\omega\)
       and \(g_1,\dots,g_m\in G\), the set \(\bigcup_{i=1}^mg_i\cdot\varphi(G)\) is not generic, which implies that the
       set \(\bigcap_{i=1}^m(G\setminus g_i\cdot\varphi(G))\) is weak generic. Extend the type \(\{\neg g\cdot\varphi(x):g\in G\}\) to
       some \(q(x)\in WGEN(G)\). Next extend \(\varphi(x)\) to \(p(x)\in WGEN(G)\). Then \(\forall g\in G\;g\cdot p\neq q\),
       a contradiction
    3. by 2, immediately
    #+END_proof

    By Lemma ref:3.2.3 (1), in the stable case weak generic = generic

    As an example note that if \(G=(G,<,+,\dots)\) is o-minimal, then there are exactly two complete weak
    generic types, corresponding to \(-\infty\) and \(+\infty\), and they are not generic

    #+ATTR_LATEX: :options []
    #+BEGIN_lemma
    Assume that \(G\prec H\) and \(\varphi(x)\in L(G)\)
    1. If \(\varphi(G)\) is weak generic in \(G\), then \(\varphi(H)\) is weak generic in \(H\)
    2. If \(G\) is \(\aleph_0\)-saturated and \(\varphi(H)\) is weak generic in \(H\), then \(\varphi(G)\) is weak
       generic in \(G\)
    #+END_lemma

    #+BEGIN_proof
    1. There is a non-generic formula \(\psi(x)\in L(G)\) s.t. \(\varphi(G)\cup\psi(G)\) is generic in \(G\),
       therefore \(\psi(H)\) is not generic in \(H\) and \(\varphi(H)\cup\psi(H)\) is generic in \(H\).
       Thus \(\varphi(H)\) is weak generic in \(H\)
    2. There is a formula \(\psi(x)\in L(H)\) s.t. \(\psi(H)\) is not generic in \(H\) and \(\varphi(H)\cup\psi(H)\) is
       generic in \(H\). We have that \(\psi(x)=\psi(x,b)\) where \(b\subset H\). Let \(A\subseteq G\)  be a finite set
       containing all parameters of \(\varphi(x)\). By \(\aleph_0\)-saturation of \(G\), we are able to find
       in \(G\) a tuple \(a\subset G\) s.t. \(\tp(a/A)=\tp(b/A)\). Then \(\psi(x,a)\in L(G)\) has properties
       needed to deduce the weak genericity of the set \(\varphi(G)\) in \(G\). Namely \(\psi(G,a)\) is not
       generic in \(G\) and \(\varphi(G)\cup\psi(G,a)\) is generic in \(G\). If \(\psi(G,a)\) is generic in \(G\),
       then for some \(0<n<\omega\) we have that
       \begin{equation*}
       G\vDash\exists x_1,\dots,x_n\forall y\exists z(\psi(z,a)\wedge\bigvee_{k=1}^ny=x_k\cdot z)
       \end{equation*}
       and the same holds in \(H\) since \(G\prec H\), which would lead to a contradiction
    #+END_proof

    All lemmas in this section remain true if we consider a group \((G,\cdot)\) definable in a first
    order structure \(M\). Then \(G\) is a definable subset of \(M^n\) for some \(n<\omega\) and for
    every \(A\subseteq M\) we define the set \(WGEN(A)\) of complete weak generic types over \(A\) as the
    set
    \begin{equation*}
    \{p\in S_n(A):\forall\varphi(x_1,\dots,x_n)\in p,G\cap\varphi(M^n)\text{ is weak generic in }G\}
    \end{equation*}

