paper/generic properties of groups.org
** Characterizations of weak genericity
    #+ATTR_LATEX: :options []
    #+BEGIN_proposition
    label:3.3.1
    Assume \(G\) is a definable group in an o-minimal structure \(M\) and \(X\) is a definable weak
    generic subset of \(G\). Then \(\dim(X)=\dim(G)\)
    #+END_proposition

    #+BEGIN_proof
    Suppose \(\dim(X)<\dim(G)\). Take a generic set \(A\) and a non-generic set \(B\)
    s.t. \(A=B\cup X\) (where \(A\) and \(B\) are definable subsets of \(G\), apply Lemma ref:3.2.1)
    Choose a finite \(S\subseteq G\) with \(S\cdot A=G\). Then \(G\setminus(S\cdot B)\subseteq S\cdot X\) and
    \begin{equation*}
    \dim(G\setminus(S\cdot B))\le\dim(S\cdot X)=\dim(X)<\dim(G)
    \end{equation*}
    Hence the set \(S\cdot B\) is large in the sense
    #+END_proof

    Assume \(G\) is a group and \(X,Y\subseteq G\). We say that the set \(X\) is *translation disjoint* from
    the set \(Y\) if for some \(a\in G\), \(a\cdot X\cap Y=\emptyset\)

    #+ATTR_LATEX: :options []
    #+BEGIN_lemma
    label:3.3.2
    Assume \(G\) is a group and \(X\) is a weak generic subset of \(G\). Then for some
    finite \(A\subseteq G\) there is no finite covering of \(X\) by sets that are translation disjoint
    from \(A\cdot X\)
    #+END_lemma

    #+BEGIN_proof
    take \(Y\supseteq X\) generic and \(Y\setminus X\) not generic. We have that \(G=A\cdot Y\) for some
    finite \(A\subseteq G\). We shall prove that \(A\) meets conditions of the lemma.

    Suppose for some \(X_0,\dots,X_{n-1}\subseteq G\) and \(a_0,\dots,a_{n-1}\in G\) we have that
    \begin{equation*}
    X=\bigcup_{i<n}X_i\text{ and }\bigwedge_{i<n}(a_i\cdot X_i)\cap(A\cdot X)=\emptyset
    \end{equation*}
    Then for each \(i<n\), \(a_i\cdot X_i\subseteq G\setminus A\cdot X\subseteq A\cdot(Y\setminus X)\). So for
    each \(i<n\), \(X_i\subseteq a_i^{-1}\cdot A\cdot(Y\setminus X)\), which implies
    that \(X\subseteq\{a_0^{-1},\dots,a_{n-1}^{-1}\}\cdot A\cdot(Y\setminus X)\) and finally
    \begin{equation*}
    G=A\cdot Y=A\cdot(Y\setminus X)\cup A\cdot X\subseteq(A\cup(A\cdot\{a_0^{-1},\dots,a_{n-1}^{-1}\}\cdot A))\cdot(Y\setminus X)
    \end{equation*}
    Then \(G\) is covered by finitely many things
    #+END_proof

    #+ATTR_LATEX: :options []
    #+BEGIN_corollary
    Assume \(G\) is a group and \(X\) is a weak generic subset of \(G\). Then the set \(X\cdot X^{-1}\)
    is generic in \(G\)
    #+END_corollary

    #+BEGIN_proof
    Take a finite \(A\subseteq G\) as in Lemma ref:3.3.2. Then for each \(a\in G\), \(a\cdot X\cap A\cdot X\neq\emptyset\), which
    implies that \(a\in A\cdot X\cdot X^{-1}\). So \(G=A\cdot X\cdot X^{-1}\)
    #+END_proof

    From now on, let \((G,<,+,\dots)\) be an o-minimal expansion of an ordered group \((G,<,+)\). Then
    the group \(G\) is commutative, divisible and torsion-free. By \((G^n,+)\) we mean the product of
    groups \((G,+)\times\dots\times(G,+)\) (\(n\) times). The ordering of \(G\) is dense since for
    every \(a,b\in G\) with \(a<b\) we have that \(a<\frac{a+b}{2}<b\)

    #+ATTR_LATEX: :options []
    #+BEGIN_theorem
    label:3.3.4
    Assume that \((G,<,+,\dots)\) is an o-minimal expansion of an ordered group \((G,<,+)\), \(0<n<\omega\)
    and \(\varphi(x_1,\dots,x_n)\in L(G)\). TFAE
    1. \(\varphi(x_1,\dots,x_n)\) is weak generic in \((G^n,+)\)
    2. \(\neg\varphi(x_1,\dots,x_n)\) is not generic in \((G^n,+)\)
    3. the set \(\varphi(G^n)\) contains arbitrarily large \(n\)-dimensional boxes
       \begin{equation*}
       (\forall R>0)(\exists a_1,\dots,a_n\in G)[a_1,a_1+R]\times\dots\times[a_n,a_n+R]\subseteq\varphi(G^n)
       \end{equation*}
    #+END_theorem

    #+BEGIN_proof
    \(3\Rightarrow 2\): suppose there is \(k<\omega\) and \(\la g_1^1,\dots,g_n^1\ra,\dots,\la g_1^k,\dots,g_n^k\ra\in G^n\) we have that
    \begin{equation*}
    G^n=\bigcup_{j=1}^k(\la g_1^j,\dots,g_n^j)+(G^n\setminus\varphi(G^n))
    \end{equation*}
    Put \(M=\max\{\abs{g_i^j}:1\le i\le n,1\le j\le k\}\). Using 3 we are able to find \(a_1,\dots,a_n\in G\) s.t.
    \begin{equation*}
    [a_1-M,a_1+M]\times\dots\times[a_n-M,a_n+M]\subseteq\varphi(G^m)
    \end{equation*}
    Then
    \begin{equation*}
    \la a_1,\dots,a_n\ra\notin\bigcup_{j=1}^k(\la g_1^j,\dots,g^j_n\ra+(G^n\setminus\varphi(G^n)))
    \end{equation*}
    a contradiction

    \(2\Rightarrow 1\): since the set \(G^n=\varphi(G^n)\cup(G^n\setminus\varphi(G^n))\) is generic in \((G^n,+)\) and the
    set \(G^n\setminus\varphi(G^n)\) is not generic

    \(1\Rightarrow 3\): W.L.O.G., \(n\ge 2\). Using Lemma ref:3.2.2 (2) find \(p(x_1,\dots,x_n)\in S_n(G)\) s.t. \(p\)
    is a weak generic type in \((G^n,+)\) and \(\varphi\in p\). Extend \(G\) to a \(\abs{G}^+\)-saturated
    group \(H\succ G\). Take \(\la a_1,\dots,a_n\ra\in H^n\) realizing \(p\) and fix a positive \(R\in G\). We shall
    show that the follwing condition holds
    \begin{equation*}
    (\forall a\in H)(a_n\le a\le a_n+R\Rightarrow\tp(a/Ga_{<n})=\tp(a_n/Ga_{<n}))\tag{\star}
    \end{equation*}

    For the sake of contradiction assume that for some \(a\in[a_n,a_n+R]_H\) the
    types \(\tp(a/Ga_{<n})\) and \(\tp(a_n/Ga_{<n})\) are distinct. By the o-minimality of \(H\), we
    can find \(b\in[a_n,a_n+R]_H\) with \(b\in\dcl(Ga_{<n})\) (dense). Let \(\psi(x_1,\dots,x_{n-1},y)\in L(G)\)
    be s.t. \(H\vDash\psi(a_{<n},b)\wedge\exists!y \psi(a_{<n},y)\). As \(b-R\le a_n\le b\), we have that \(\chi\in p\) where
    \begin{equation*}
    \chi(x_1,\dots,x_n)=\exists!y\psi(x_{<n},y)\wedge\forall y(\psi(a_{<n},y))\to(y-R\le x_n\le y)
    \end{equation*}
    Since \(\chi\in p\), the set \(\chi(G^n)\) is weak generic in \((G^n,+)\)

    We define \(f:G^{n-1}\to G\) as follows. Take \(\la c_1,\dots,c_{n-1}\ra\in G^{n-1}\). If there is \(c_n\in G\)
    s.t. \(G\vDash\chi(c_1,\dots,c_n)\), then there exists just one \(d\in G\) with \(G\vDash\psi(c_1,\dots,c_{n-1},d)\) and we
    put \(f(c_1,\dots,c_{n-1})=d-R\). Otherwise we put \(f(c_1,\dots,c_{n-1})=0\). Then the function \(f\) is
    definable over \(G\) and we consider the following formula over \(G\):
    \begin{equation*}
    \delta(x_1,\dots,x_n)=f(x_1,\dots,x_{n-1})\le x_n\le f(x_1,\dots,x_{n-1})+R
    \end{equation*}
    Since \(\chi(G^n)\subseteq\delta(G^n)\subseteq G^n\), the set \(\delta(G^n)\) is weak generic in \((G^n,+)\). Let \(A\subseteq G^n\) be a
    finite set chosen for \(\delta(G^n)\) as in Lemma ref:3.3.2. Consider an
    arbitrary \(\la h_1,\dots,h_n\ra\in H^{n-1}\). Choose \(M_{h_{<n}}\in G\) s.t.
    \begin{equation*}
    \{\la h_1,\dots,h_n\ra:f(h_{<n})+M_{h_{<n}}\le h_n\le f(h_{<n})+M_{h_{<n}}+R\}
    \cap(A+\delta(H^n))=\emptyset
    \end{equation*}
    If \(\tp(h_{<n}/G)=\tp(h'_{<n}/G)\), then \(M_{h_{<n}}\) is good also for \(h'_{<n}\). By
    compactness, for each \(q(x_1,\dots,x_{n-1})\in S_{n-1}(G)\) we can find a
    formula \(\varphi_q(x_1,\dots,x_{n-1})\in L(G)\) and \(M_q\in G\) s.t. for every \(h_{<n}\in H^{n-1}\) with
    \(H\vDash\varphi_q(h_{<n})\) we have
    \begin{equation*}
    \{\la h_1,\dots,h_n\ra:f(h_{<n})+M_q\le h_n\le f(h_{<n})+M_q+R\}\cap(A+\delta(H^n))=\emptyset
    \end{equation*}
    Again by compactness, \(S_{n-1}(G)=[\varphi_{q_1}]\cup\dots\cup[\varphi_{q_k}]\) for some \(k<\omega\)
    and \(q_1,\dots,q_k\in S_{n-1}(G)\). For \(i\in\{1,\dots,k\}\) put \(X_i=(\varphi_{q_i}(G^{n-1})\times G)\cap\delta(G^n)\)
    and \(e_i=\la 0,\dots,0,M_{q_i}\ra\in G^n\). Then \(\delta(G^n)=X_1\cup\dots\cup X_k\) and for every \(i\in\{1,\dots,k\}\) we have
    that \((e_i+X_i)\cap(A+\delta(G^n))=\emptyset\). This contradicts the choice of \(A\) and finishes the proof of (\(\star\))
    #+END_proof

    #+ATTR_LATEX: :options []
    #+BEGIN_corollary
    Assume that \((G,<,+,\dots)\) is an o-minimal expansion of an ordered group \((G,<,+)\), \(0<n,k<\omega\)
    and \(\varphi(x_1,\dots,x_n,y_1,\dots,y_k)\in L\)
    1. there is \(\psi_1(y_1,\dots,y_k)\) s.t. for every \(\la a_1,\dots,a_k\ra\in G^k\) we have that \(G\vDash\psi_1(a)\)
       iff \(\varphi(G^n,a)\) is weak generic in \((G^n,+)\)
    2. There is \(\psi_2(y_1,\dots,y_k)\) s.t. for every \(\la a_1,\dots,a_k\ra\in G^k\) we have that \(G\vDash\psi_2(a)\)
       iff \(\varphi(G^n,a)\) is generic in \((G^n,+)\)
    3. there is a natural number \(N\) s.t. for every \varphi-definable \(X\subseteq G^n\) the set \(X\) is generic
       in \((G^n,+)\) iff \(G^n\) may be covered by at most \(N\) left translates of \(X\)
    #+END_corollary

    #+BEGIN_proof
    1. let \(\psi_1(y_1,\dots,y_k)\) be
       \begin{equation*}
       \forall r\exists z_1,\dots,z_n\forall x_1,\dots,x_n((\bigwedge_{i=1}^nz_i\le x_i\wedge x_i\le z_i+r)\to\varphi(x_1,\dots,x_n,y_1,\dots,y_k))
       \end{equation*}
    3. [@3] Assume that \(n=1\). Let \(\psi_2(y_1,\dots,y_k)\) be such as 2. Suppose for every \(N<\omega\) we can
       find \(\la a_1,\dots,a_k\ra\in G^k\) s.t. the set \(\varphi(G,a_1,\dots,a_k)\) is generic in \(G\) but
       not \(N\)-generic. Then the set of formulas
       \begin{equation*}
       \bigcup_{N<\omega}\{\psi_2(y_1,\dots,y_k)\wedge\forall z_1,\dots,z_N\exists t\forall x(\varphi(x,y_1,\dots,y_k)\to\bigwedge_{i=1}^Nt\neq z_i\cdot x)\}
       \end{equation*}
       is a type in variables \(y_1,\dots,y_k\) and has a realization \(\la b_1,\dots,b_k\ra\in H^k\) in
       some \(\aleph_0\)-saturated elementary extension \(H\) of \(G\). Then we reach a contradiction as
       the set \(\varphi(H,b_1,\dots,b_k)\) is simultaneously generic and not generic in \(H\)
    #+END_proof

    #+ATTR_LATEX: :options []
    #+BEGIN_corollary
    Assume that \((G,<,+,\dots)\) is an o-minimal expansion of an ordered group \((G,<,+)\), \(0<n<\omega\),
    and \(p(x_1,\dots,x_n)\in S_n(G)\). TFAE
    1. \(p(x_1,\dots,x_n)\) is weak generic in \((G^n,+)\)
    2. \(\la g_1,\dots,g_n\ra+p(x_1,\dots,x_n)=p(x_1,\dots,x_n)\) for every \(\la g_1,\dots,g_n\ra\in  G^n\)
    #+END_corollary

    #+BEGIN_proof
    \(1\Rightarrow 2\): suppose
    \begin{equation*}
    \la g_1,\dots,g_n\ra+p(x_1,\dots,x_n)\neq p(x_1,\dots,x_n)
    \end{equation*}
    for some \(\la g_1,\dots,g_n\ra\in G^n\). Then for some \(\varphi(x_1,\dots,x_n)\in p(x_1,\dots,x_n)\) we have that
    \((\la g_1,\dots,g_n\ra+\varphi(G^n))\cap\varphi(G^n)=\emptyset\). \(\varphi(G^n)\) is weak generic in \((G^n,+)\) and hence contains
    arbitrarily large boxes. Take any \(R>\max(\abs{g_1},\dots,\abs{g_n})\) and choose \(a_1,\dots,a_n\in G\)
    s.t.
    \begin{equation*}
    B=[a_1,a_1+R]\times\dots\times[a_n,a_n+R]\subseteq\varphi(G^n)
    \end{equation*}
    we obtain
    \begin{equation*}
    \emptyset\neq(\la g_1,\dots,g_n\ra+B)\cap B\subseteq(\la g_1,\dots,g_n\ra+\varphi(G^n))\cap\varphi(G^n)=\emptyset
    \end{equation*}
    a contradiction

    \(2\Rightarrow 1\): we shall prove a more general fact. Namely if \(G\) is a group and \(p(x)\in S(G)\) is
    s.t. for every \(g\in G\) we have that \(g\cdot p=p\), then \(p\) is weak generic in \(G\)

    If not, then we can find a formula \(\varphi(x)\in p(x)\) which is not weak generic in \(G\).
    Then \(\neg\varphi(x)\) is generic in \(G\) so there are \(m<\omega\) and \(g_1,\dots,g_m\in G\)
    s.t \(G=\bigcup_{i=1}^mg_i(G\setminus\varphi(G))\). Thus \(\bigcap_{i=1}^mg_i\cdot\varphi(G)=\emptyset\), which contradicts the fact that the
    formulas \(g_1\cdot\varphi,\dots,g_m\cdot\varphi\) belong to the consistent type \(p(x)\)
    #+END_proof

