latex/papers/generic properties of groups.tex

\subsection{Stationary}
\label{sec:org4d8f30a}
In this section we assume that \((G,<,+,\dots)\) is an o-minimal expansion of an ordered
group \((G,<,+)\)

Recall that in stable group all weak generic types are generic. \label{Problem2} Moreover, all of
them are stationary over any model \(M\). This means that every (weak) generic type \(p\in S(M)\)
has a unique extension to a (weak) generic type \(q\in S(A)\) for each \(A\supseteq M\)

\begin{definition}[]
We call a weak generic type \(p\) over a set \(A\) \textbf{stationary} if for every \(B\supseteq A\) the
type \(p\) has just one extension to a complete weak generic type over \(B\)
\end{definition}

In general weak generic types do not need to be stationary

\begin{examplle}[]
we shall prove that the types \(p_1(x)=\{x<a:a\in G\}\) and \(p_2(x)=\{x>a:a\in G\}\) are the only two
weak generic types in \((G,+)\) complete over \(G\) and that both of them are stationary

By the o-minimality of \((G,<,+,\dots)\), every definable subset of \(G\) is a union of finitely
many points and intervals. For every \(a,b\in G\) the interval \((a,b)\) is not weak generic
in \((G,+)\) by Lemma \ref{3.2.1} (2). Thus no type in \(S_1(G)\) but \(p_1\) and \(p_2\) is weak
generic in \((G,+)\)

On the other hand, all intervals of the form \((-\infty,a)\) or \((b,+\infty)\) are weak generic
in \((G,+)\) since their complements in \(G\) are not generic in \((G,+)\).  This gives us the
weak genericity of the types \(p_1\) and \(p_2\)

If \(H\) is any elementary extension of \(G\), then there are also two complete (over \(H\))
weak generic types in \((H,+)\). This means that \(p_1\) and \(p_2\) are stationary
\end{examplle}

\begin{definition}[]
We call an o-minimal structure \((M,<,\dots)\) \textbf{stationary} if for every elementary extension \(N\)
of \(M\) and \(N\)-definable function \(g:N\to N\) there exists an \(M\)-definable
function \(f:N\to N\) s.t. \(g(x)\le f(x)\) for all sufficiently large \(x\in N\)
\end{definition}

\begin{theorem}[]
\label{3.4.4}
Assume \((M,<,\dots)\) is a stationary o-minimal structure and \(N\succ M\). For every \(N\)-definable
map \(g:N\to N\) with \(\lim_{x\to+\infty}g(x)=+\infty\)  we can find an \(M\)-definable map \(f:N\to N\)
s.t. \(\lim_{x\to+\infty}f(x)=+\infty\) and \(f(x)\le g(x)\) for all sufficiently large \(x\in N\)
\end{theorem}


\begin{proof}
First of all, assume that \(g\) is a bijection. Then \(g^{-1}\) exists and by the stationary
of \((M,<,\dots)\) we can find an \(M\)-definable function \(f:N\to N\) s.t. ultimately \(g^{-1}\le f\).
We have that \(\lim_{x\to+\infty}g^{-1}(x)=+\infty\), which implies that \(\lim_{x\to+\infty}f(x)=+\infty\). Since \(f\)
is \(M\)-definable, we can choose \(a\in M\) s.t. \(f\) is strictly increasing on \((a,+\infty)\)
(monotonicity theorem). We define a function \(f_1:N\to N\) as follows
\begin{equation*}
f_1(x)=
\begin{cases}
f(x)&x>a\\
f(a)+x-a&x\le a
\end{cases}
\end{equation*}
Then \(f_1\) is an \(M\)-definable bijection, hence \(f_1^{-1}\) exists and also
is \(M\)-definable. Moreover, \(\lim_{x\to+\infty}f_1^{-1}(x)=+\infty\) and ultimately \(f^{-1}_1\le g\)
so \(f_1^{-1}\) has the desired properties

If \(g\) is not a bijection, then proceeding as above we can find an \(N\)-definable
bijection \(g_1:N\to N\) s.t. ultimately \(g_1=g\)
\end{proof}

By the o-minimality of \((G,<,+,\dots)\), every definable subset of the set \(G\times G\) is a union of
finitely many cells of dimension 0,1,2. By Proposition \ref{3.3.1}, we are interested only in
cells of dimension 2. They are of the form
\begin{equation*}
C_{a,b}^{f,g}=\{\la x,y\ra\in G\times G:a<x<b\wedge f(x)<y<g(x)\}
\end{equation*}
where \(\{-\infty\}\cup G\ni a<b\in G\cup\{\infty\}\) and \(f,g:(a,b\to G\cup\{-\infty,\infty\}\) are definable maps s.t. \(f(x)<g(x)\)
for each \(x\in(a,b)\). If \(a,b\in G\), then the cell \(C_{a,b}^{f,g}\) is not weak generic
in \((G,+)\times(G,+)\) by Theorem \ref{3.3.4}





\section{Problems}
\label{sec:org1303290}
\begin{center}
\begin{tabular}{ll}
\ref{Problem1} & \ref{Problem2}\\
\\
\end{tabular}
\end{center}
\end{document}
